driver-tests/smtpbc/SMTPBCTests/SMTPEncTestJBI/src/jbiServiceUnits/SMTPEncTestBPEL/TriggerWsdl.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions targetNamespace="http://j2ee.netbeans.org/wsdl/TriggerWsdl"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
     xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/TriggerWsdl" name="TriggerWsdl" xmlns:ns="http://xml.netbeans.org/schema/TestXmlSchema" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:file="http://schemas.sun.com/jbi/wsdl-extensions/file/">
    <wsdl:types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/TriggerWsdl">
            <xsd:import namespace="http://xml.netbeans.org/schema/TestXmlSchema" schemaLocation="TestXmlSchema.xsd"/>
        </xsd:schema>
    </wsdl:types>
    <wsdl:message name="TriggerWsdlOperationRequest">
        <wsdl:part name="part1" element="ns:root"/>
    </wsdl:message>
    <wsdl:message name="TriggerWsdlOperationReply">
        <wsdl:part name="part1" element="ns:root"/>
    </wsdl:message>
    <wsdl:portType name="TriggerWsdlPortType">
        <wsdl:operation name="TriggerWsdlOperation">
            <wsdl:input name="input1" message="tns:TriggerWsdlOperationRequest"/>
            <wsdl:output name="output1" message="tns:TriggerWsdlOperationReply"/>
        </wsdl:operation>
    </wsdl:portType>
    <wsdl:binding name="TriggerWsdlBinding" type="tns:TriggerWsdlPortType">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="TriggerWsdlOperation">
            <soap:operation style="document"/>
            <wsdl:input name="input1">
                <soap:body use="literal" parts="part1"/>
            </wsdl:input>
            <wsdl:output name="output1">
                <soap:body use="literal" parts="part1"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:service name="TriggerWsdlService">
        <wsdl:port name="TriggerWsdlPort" binding="tns:TriggerWsdlBinding">
            <soap:address location="http://localhost:18181/TriggerWsdlService/TriggerWsdlPort"/>
        </wsdl:port>
    </wsdl:service>
    <plnk:partnerLinkType name="TriggerWsdlPartner">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="TriggerWsdlPortTypeRole" portType="tns:TriggerWsdlPortType"/>
    </plnk:partnerLinkType>
</definitions>
