driver-tests/smtpbc/SMTPBCTests/SMTPEncTestJBI/test/TestCase1/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns0="http://xml.netbeans.org/schema/TestXmlSchema" xmlns="http://xml.netbeans.org/schema/TestXmlSchema">
<SOAP-ENV:Body>
  <root xmlns="http://xml.netbeans.org/schema/TestXmlSchema">
    <ns0:groupNode xmlns:ns0="http://xml.netbeans.org/schema/TestXmlSchema">
      <ns0:element1>
        <ns0:delimElement1>a</ns0:delimElement1>
        <ns0:delimElement2>b</ns0:delimElement2>
      </ns0:element1>
      <ns0:element2>
        <ns0:fixedElement1>0123456789</ns0:fixedElement1>
        <ns0:fixedElement2>abcde0123456789</ns0:fixedElement2>
      </ns0:element2>
    </ns0:groupNode>
  </root>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
