driver-tests/smtpbc/SMTPBCTests/SMTPEncTestJBI/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tes="http://xml.netbeans.org/schema/TestXmlSchema">
  <soapenv:Body>
    <tes:root>
      <tes:groupNode>
        <tes:element1>
          <tes:delimElement1>a</tes:delimElement1>
          <tes:delimElement2>b</tes:delimElement2>
        </tes:element1>
        <tes:element2>
          <tes:fixedElement1>0123456789</tes:fixedElement1>
          <tes:fixedElement2>abcde0123456789</tes:fixedElement2>
        </tes:element2>
      </tes:groupNode>
    </tes:root>
  </soapenv:Body>
</soapenv:Envelope>